SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ
FROM Н_ЛЮДИ
WHERE Н_ЛЮДИ.ИД NOT IN
      (SELECT DISTINCT Н_ЛЮДИ.ИД
       FROM Н_УЧЕНИКИ
                LEFT JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
                LEFT JOIN Н_ВЕДОМОСТИ
                          ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
                              AND DATE_PART('year', AGE(Н_ВЕДОМОСТИ.ДАТА, Н_УЧЕНИКИ.НАЧАЛО)) < 1
                              AND Н_ВЕДОМОСТИ.ДАТА > Н_УЧЕНИКИ.НАЧАЛО
       WHERE Н_ВЕДОМОСТИ.ОЦЕНКА in ('2', 'незачет')
);
